Tested with a new match list

```
resource "sumologic_cse_match_list" "test2" {
  name          = "tf-provider-test"
  description   = "Testing"
  target_column = "SrcIp"

  items {
    description = "test"
    value       = "1.1.1.1"
  }
}
```

Plan:
```
Terraform will perform the following actions:

  # sumologic_cse_match_list.test2 will be created
  + resource "sumologic_cse_match_list" "test2" {
      + created         = (known after apply)
      + created_by      = (known after apply)
      + description     = "Testing"
      + id              = (known after apply)
      + last_updated    = (known after apply)
      + last_updated_by = (known after apply)
      + name            = "tf-provider-test"
      + target_column   = "SrcIp"

      + items {
          + description = "test"
          + id          = (known after apply)
          + value       = "1.1.1.1"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
Apply:
```
sumologic_cse_match_list.test2: Creating...
sumologic_cse_match_list.test2: Still creating... [10s elapsed]
sumologic_cse_match_list.test2: Creation complete after 16s [id=86]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Add item
```
resource "sumologic_cse_match_list" "test2" {
  name          = "tf-provider-test"
  description   = "Testing"
  target_column = "SrcIp"

  items {
    description = "test"
    value       = "1.1.1.1"
  }
  items {
    description = "test2"
    value       = "8.8.8.8"
  }
}
```

Plan:
```
Terraform will perform the following actions:

  # sumologic_cse_match_list.test2 will be updated in-place
  ~ resource "sumologic_cse_match_list" "test2" {
        id              = "86"
        name            = "tf-provider-test"
        # (7 unchanged attributes hidden)

      - items {
          - description = "test" -> null
          - id          = "5ebcb1d684fe3a9e8571470397e888c0e086aa137fa13f67927b39d0eca1861074662d70726f76696465722d74657374" -> null
          - value       = "1.1.1.1" -> null
        }
      + items {
          + description = "test"
          + id          = "5ebcb1d684fe3a9e8571470397e888c0e086aa137fa13f67927b39d0eca1861074662d70726f76696465722d74657374"
          + value       = "1.1.1.1"
        }
      + items {
          + description = "test2"
          + id          = (known after apply)
          + value       = "8.8.8.8"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

Apply fails. In debug logs I see
```
2023-09-20T15:00:10.387-0400 [DEBUG] provider.terraform-provider-sumologic_v2.25.0: 2023/09/20 15:00:10 [WARN] An error occurred while adding match list items to match list id: 86, err: {"data": null, "errors": [{"message": "Invalid values provided for parameter \"items\": ", "code": "BAD_REQUEST"}]}
```